# YOLOv8 with CBAM attention in neck and Deformable Conv downsampling
# Start from yolov8.yaml and replace selected modules in head with C2fCBAM and DeformConv

# Parameters
nc: 80  # number of classes (override in code if needed)
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone (unchanged)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# Head with CBAM and Deformable Conv
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512]]  # CBAM-enhanced

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [256]]  # CBAM-enhanced

  - [-1, 1, DeformConv, [256, 3, 2]]  # deformable downsample
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512]]  # CBAM-enhanced

  - [-1, 1, DeformConv, [512, 3, 2]]  # deformable downsample
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [1024]]  # CBAM-enhanced

  - [[15, 18, 21], 1, Detect, [nc]]
